deploy/cases/infinilm-metax-deployment-opt-20260325/bench/bench-jg_rag-jg_rag-9g8b-rerun-remote-router.log
INFO 03-27 17:31:08 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 03-27 17:31:09 [interface.py:221] Failed to import from vllm._C: ModuleNotFoundError("No module named 'vllm._C'")
Namespace(seed=0, num_prompts=40, dataset_name='custom', no_stream=False, dataset_path='/home/zenghua/workspace/infinilm-svc-refactor/InfiniOrchestrator/deploy/cases/infinilm-metax-deployment-opt-20260325/bench/jg_rag_benchmark.jsonl', no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label='jg_rag-9g8b-rerun', backend='openai-chat', base_url=None, host='192.168.163.151', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=4, model='9g_8b_thinking', input_len=None, output_len=None, tokenizer='/data-aisoft/zenghua/models/9g_8b_thinking_llama', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/home/zenghua/workspace/infinilm-svc-refactor/InfiniOrchestrator/deploy/cases/infinilm-metax-deployment-opt-20260325/results', result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-50580b83-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, common_prefix_len=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, prompt_cache_key=None)
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
100%|██████████| 40/40 [05:34<00:00,  8.35s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     40        
Failed requests:                         0         
Maximum request concurrency:             4         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  334.07    
Total input tokens:                      366782    
Total generated tokens:                  43532     
Request throughput (req/s):              0.12      
Output token throughput (tok/s):         130.31    
Peak output token throughput (tok/s):    583.00    
Peak concurrent requests:                5.00      
Total token throughput (tok/s):          1228.22   
---------------Time to First Token----------------
Mean TTFT (ms):                          1174.09   
Median TTFT (ms):                        708.00    
P99 TTFT (ms):                           3693.77   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          27.35     
Median TPOT (ms):                        26.52     
P99 TPOT (ms):                           35.69     
---------------Inter-token Latency----------------
Mean ITL (ms):                           27.13     
Median ITL (ms):                         23.90     
P99 ITL (ms):                            173.70    
==================================================